In [1]:
import pandas as pd

In [12]:
df = pd.read_csv('V5.csv')
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

In [3]:
df.shape

(10000, 12)

In [4]:
df_c = df.copy()

In [18]:
print(df_c.eq('?').sum().sum())

1823

In [19]:
df_c['Property'].replace('?', pd.NA, inplace=True)
df_c['Property']

0       Single Family
1          Two Family
2       Single Family
3       Single Family
4                <NA>
            ...
9995             <NA>
9996             <NA>
9997    Single Family
9998    Single Family
9999    Single Family
Name: Property, Length: 10000, dtype: object

In [23]:
df_c.shape

(10000, 12)

In [34]:
df_c.iloc[692, 0]

'2009-11-16'

In [37]:
df_c.iloc[546, 7]

3

In [39]:
df_c['Locality'].unique()

array(['Waterbury', 'Bridgeport', 'Greenwich', 'Norwalk', nan,
       'Fairfield', 'West Hartford', 'Stamford'], dtype=object)

In [55]:
print((df_c.isna().sum(axis=1) > 2).sum())
df_c.dropna(inplace=True)
print((df_c.isna().sum(axis=1) > 2).sum())

83
0

In [57]:
df_c.shape

(5449, 12)

In [56]:
df.dropna(inplace=True)
df.shape

(6700, 12)